app/controllers/sessions_controller.rb

SELECT "vendors".* FROM "vendors" WHERE "vendors"."provider" = 'amazon' AND "vendors"."uid" = 'amzn1.account.AEQ6NQMSND4NODOLT3K5C2QM7C4Q' LIMIT 1
INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 09 Mar 2015 04:22:20 UTC +00:00], ["name", "Kent Kent"], ["provider", "facebook"], ["uid", "1546169615634678"], ["updated_at", Mon, 09 Mar 2015 04:22:20 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."provider" = 'facebook' AND "users"."uid" = '1546169615634678' LIMIT 1
---
  def create  ## Need to implement whether it's vendor or user
    # user = User.from_omniauth(env["omniauth.auth"])
    auth = request.env["omniauth.auth"]

    vendor = Vendor.find_by_provider_and_uid(auth["provider"], auth["uid"])

    if vendor != nil
      session[:vendor_id]= vendor.id
      redirect_to '/vendors/home', notice: "home page, vendor"
    else
      user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "code" = '2941991', "updated_at" = '2015-03-11 01:53:24.956288' WHERE "users"."id" = 1
---
  def offer
    # current_user = User.find(session[:user_id])
    if session[:user_id] != nil
      current_user = User.find(session[:user_id])
      if current_user.code? || current_user.code == ""
        @current_code = params[:code]
        current_user.code = @current_code
        current_user.save!